Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ProblemWithPowerLoadWarn Property
 [Room]'s power load is too high. This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProblemWithPowerLoadWarn { get; }
Public Shared ReadOnly Property ProblemWithPowerLoadWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProblemWithPowerLoadWarn {
	FailureDefinitionId^ get ();
}
static member ProblemWithPowerLoadWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace